doc/rust/lifetime.org
# -*- coding:utf-8 -*-
#+AUTHOR: ifritJP
#+STARTUP: nofold
#+OPTIONS: ^:{}
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-mode-document.css" />
#+HTML_HEAD: <meta http-equiv="Pragma" content="no-cache">
#+HTML_HEAD: <meta http-equiv="Cache-Control" content="no-cache"> 

#+TITLE: C/C++エンジニアのための Rust のデータ所有権とライフタイム入門

# org-mode 簡易リファレンス
# ○ 展開
# C-u C-u C-u C-i で 全展開
# ○ 見出し編集
# 行頭 * で見出し. * の数で見出しのレベルを表現.
# M-RET で次の見出し
# M-right, M-left でレベル調整
# ○ リスト
# + or - で リスト表示
# ○ プロパティ
# :PROPERTIES: で開始し、:END: で終了。
# プロパティは : で囲む。例えば :property:
# CUSTOM_ID プロパティ
#  :CUSTOM_ID: propertyname
# ○ リンク
# C-c C-l でリンク編集
# C-c C-o でリンク先にジャンプ
# CUSTOM_ID プロパティをリンクする場合 #propertyname
# ○ 画像
# 画像はリンク
# リンク名を file:image_path にする
# M-x org-toggle-inline-images で、org-mode 内での画像インライン表示を切り替え
# HTML に出力する場合、リンクの直前の行に次を書くと HTML でのサイズを指定可能
# #+ATTR_HTML: :width 128
# ○ 出力
# C-c C-e h で HTML に出力


* 初めに

Rust のキモであるライフタイムの概念において、
ネットの解説ドキュメントでは自分には理解が困難だったため、
Rust を動かして自分なりに確認した結果をまとめる。

使用した Rust は 1.17.0 である。

なお、ライフタイムを理解するには所有権の知識が必要なため、所有権の説明から始める。

所有権の理解が十分な場合は、前半は飛して構わない。


* 変数の制約

Rust は、データのライフタイムを厳密に管理することで、
コンパイル時にメモリ破壊の可能性を検知する機能を持っている。


一般的にプログラムでは、
生成したデータを変数に代入してデータを操作することになるが、
Rust ではこの変数に次の制約を付けている。

+ 変数は、データに対して所有権(ownership)とアクセス権を持つ。
+ あるデータに対する所有権を持つ変数がスコープから外れた時に、そのデータは開放される。
+ あるデータに対する所有権を持つ変数は、アクセス権も持つ。
+ アクセス権には、読み出し専用(immutable)と、読み書き用(mutable)がある。  
+ アクセス権のデフォルトは、読み出し専用 (immutable)。
+ 変数にデータを代入すると、所有権とアクセス権がその変数に移る。 (1つのデータの所有権を持てる変数は 1 つだけ。)
+ 代入元の変数は、何もデータを格納していない状態になり、この変数に対してデータ読み込みアクセスするとコンパイルエラーになる。
+ 変数は、別の変数にアクセス権だけを与えることができる。
  + 読み出し専用のアクセス権(Reference)は、複数の変数に与えることができる。
  + 読み書き用のアクセス権(Borrowing)は、1 つの変数に与えることができる。
  + あるデータの Reference と Borrowing は、どちらか一方しか同時に存在出来ない。
+ ある変数に格納されたデータへのアクセス権(Reference/Borrowing)を、そのデータのライフタイムより広いライフタイムを持つ変数に与えることはできない。

基本的には、この 12 個である。

C は、次のような処理が書けてしまう。

#+BEGIN_SRC c
{
  int *pVal;
  {
     int val = 1;
     pVal = &val;
  }
  *pVal = 2;
}
#+END_SRC

これは、最後の *pVal への代入で val のアドレスにデータを書き込むが、
そのアドレスは書き込み時点では既に無効になっているため、
この動作による影響は不定でありメモリ破壊が発生する。


上記 C と同じような意味の処理を Rust で書くと次のようになるが、
これはコンパイルエラーになる。

#+BEGIN_SRC rust
{
  let rval;
  {
     let mut val = 1;
     rval = &mut val; // error
  }
  *rval = 2;
}
#+END_SRC

これは、
「ある変数に格納されたデータへのアクセス権(Reference/Borrowing)を、そのデータのライフタイムより広いライフタイムを持つ変数に与えることはできない。」
の制約から外れているためエラーとなる。

ライフタイムについては後述するが、ここではスコープと同義であると考えて良い。


このように、Rust は、データのライフタイムを厳密に管理することで、
コンパイル時にメモリ破壊の可能性を検知する機能を持っている。

以降では、上記 Rust の変数についての制約について説明する。

** あるデータに対する所有権を持つ変数がスコープから外れた時に、そのデータは開放される。

  データには所有権があり、その所有権を持つ変数がスコープから外れると、そのデータは開放される。
  
  C のように malloc/free を明示的に呼び出す必要はない。

#+BEGIN_SRC rust
{
  let val = vec![1,2,3];
  println!( "{}", val[0] );
}
#+END_SRC

  上記の例では、 val には Vec 型のデータの所有権が与えられ、
  println!() でデータを表示後、 val のスコープが外れるため、
  Vec 型のデータが開放される。

  C++ では、似たように機能する unique_ptr がある。

  「C++ の unique_ptr のようなもの」と説明したが、
  C++ で出来るなら Rust を使う意味はないじゃないか？という疑問を持つ方もいるだろう。
  だが、 C++ は unique_ptr が「使える」のであって、
  それを使うかどうかはプログラマ次第である。
  また、その使用方法に論理的な間違えがあったとしてもコンパイルは成功してしまい、
  実行時にエラーが発生することで初めて間違っていたことが分かる。
  
  対して Rust は、プログラマ次第で「使える」のではなく、それしか「使えない」。
  また、使用方法に論理的な間違えがあればコンパイル時に分かる。
  
  これは重要な違いである。

  静的型付け言語を選択する理由の一つには、コンパイル時にさまざまな論理的なエラーを
  検知できることが大きい。
  これは、 Google が TypeScript を採用していることからも容易に想像できるだろう。
  
  Rust は、コンパイル時検知可能なエラーに型エラーだけでなく、
  メモリ破壊も検知できることが特徴の言語である。


** あるデータに対する所有権を持つ変数は、アクセス権も持つ。
** アクセス権には、読み出し専用(immutable)と、読み書き用(mutable)がある。  
** アクセス権のデフォルトは、読み出し専用 (immutable)。

  アクセス権とは、データの値を読み出す、書き込むことが出来る権利である。

  C で const 宣言することで書き込みアクセスを禁止出来るように、
  Rust でもデータアクセスに対する制御が可能である。
  
  多くの言語では、デフォルトのアクセス権は読み書き可能(mutable)であるのに対して、
  Rust のデフォルトは読み出し専用(immutable)である。
  
  これは、上記で説明しているメモリ破壊検知を可能にする構文を前提に考えた場合、
  デフォルトを mutable にした方が、デフォルトを immutable にするよりも
  コーディング量が増える可能性があるためだと考えられる。


** 変数にデータを代入すると、所有権とアクセス権がその変数に移る。 (1つのデータの所有権を持てる変数は 1 つだけ。)
