hugo/public/rust/lifetime/index.html
<!DOCTYPE html>
<html lang="ja-jp">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門 - 公開技術情報</title>
<meta name="generator" content="Hugo 0.109.0">
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/rust/lifetime/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門" />
<meta property="og:description" content="初めに Rust のキモであるライフタイムの概念において、 ネットの解説ドキュメントでは自分には理解が困難だったため、 Rust を動かして自分なりに確認した結果" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/rust/lifetime/" /><meta property="article:section" content="rust" />

<meta property="og:site_name" content="公開技術情報" />
<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門"/>
<meta name="twitter:description" content="初めに Rust のキモであるライフタイムの概念において、 ネットの解説ドキュメントでは自分には理解が困難だったため、 Rust を動かして自分なりに確認した結果"/>
<meta itemprop="name" content="C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門">
<meta itemprop="description" content="初めに Rust のキモであるライフタイムの概念において、 ネットの解説ドキュメントでは自分には理解が困難だったため、 Rust を動かして自分なりに確認した結果">

<meta itemprop="wordCount" content="6542">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/lnsc_web_frontend/for_fengari/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門</h1>

<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
初めに
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
Rust のキモであるライフタイムの概念において、
ネットの解説ドキュメントでは自分には理解が困難だったため、
Rust を動かして自分なりに確認した結果をまとめる。</p>
<p>
使用した Rust は 1.17.0 である。</p>
<p>
なお、ライフタイムを理解するには所有権の知識が必要なため、所有権の説明から始める。</p>
<p>
所有権の理解が十分な場合は、前半は飛して構わない。</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
変数の制約
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
Rust は、データのライフタイムを厳密に管理することで、
コンパイル時にメモリ破壊の可能性を検知する機能を持っている。</p>
<p>
一般的にプログラムでは、
生成したデータを変数に代入してデータを操作することになるが、
Rust ではこの変数に次の制約を付けている。</p>
<ul>
<li>変数は、データに対して所有権(ownership)とアクセス権を持つ。</li>
<li>あるデータに対する所有権を持つ変数がスコープから外れた時に、そのデータは開放される。</li>
<li>あるデータに対する所有権を持つ変数は、アクセス権も持つ。</li>
<li>アクセス権には、読み出し専用(immutable)と、読み書き用(mutable)がある。  </li>
<li>アクセス権のデフォルトは、読み出し専用 (immutable)。</li>
<li>変数にデータを代入すると、所有権とアクセス権がその変数に移る。 (1つのデータの所有権を持てる変数は 1 つだけ。)</li>
<li>代入元の変数は、何もデータを格納していない状態になり、この変数に対してデータ読み込みアクセスするとコンパイルエラーになる。</li>
<li>
<p>変数は、別の変数にアクセス権だけを与えることができる。</p>
<ul>
<li>読み出し専用のアクセス権(Reference)は、複数の変数に与えることができる。</li>
<li>読み書き用のアクセス権(Borrowing)は、1 つの変数に与えることができる。</li>
<li>あるデータの Reference と Borrowing は、どちらか一方しか同時に存在出来ない。</li>
</ul>
</li>
<li>ある変数に格納されたデータへのアクセス権(Reference/Borrowing)を、そのデータのライフタイムより広いライフタイムを持つ変数に与えることはできない。</li>
</ul>
<p>基本的には、この 12 個である。</p>
<p>
C は、次のような処理が書けてしまう。</p>
<div class="src src-c">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-c" data-lang="c"><span class="line"><span class="cl"><span class="p">{</span>
</span></span><span class="line"><span class="cl">  <span class="kt">int</span> <span class="o">*</span><span class="n">pVal</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="p">{</span>
</span></span><span class="line"><span class="cl">     <span class="kt">int</span> <span class="n">val</span> <span class="o">=</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">     <span class="n">pVal</span> <span class="o">=</span> <span class="o">&amp;</span><span class="n">val</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="p">}</span>
</span></span><span class="line"><span class="cl">  <span class="o">*</span><span class="n">pVal</span> <span class="o">=</span> <span class="mi">2</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span></span></span></code></pre></div>
</div>
<p>
これは、最後の *pVal への代入で val のアドレスにデータを書き込むが、
そのアドレスは書き込み時点では既に無効になっているため、
この動作による影響は不定でありメモリ破壊が発生する。</p>
<p>
上記 C と同じような意味の処理を Rust で書くと次のようになるが、
これはコンパイルエラーになる。</p>
<div class="src src-rust">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-rust" data-lang="rust"><span class="line"><span class="cl"><span class="p">{</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="kd">let</span><span class="w"> </span><span class="n">rval</span><span class="p">;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="p">{</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">     </span><span class="kd">let</span><span class="w"> </span><span class="k">mut</span><span class="w"> </span><span class="n">val</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="mi">1</span><span class="p">;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">     </span><span class="n">rval</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="o">&amp;</span><span class="k">mut</span><span class="w"> </span><span class="n">val</span><span class="p">;</span><span class="w"> </span><span class="c1">// error
</span></span></span><span class="line"><span class="cl"><span class="c1"></span><span class="w">  </span><span class="p">}</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="o">*</span><span class="n">rval</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="mi">2</span><span class="p">;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w"></span><span class="p">}</span></span></span></code></pre></div>
</div>
<p>
これは、
「ある変数に格納されたデータへのアクセス権(Reference/Borrowing)を、そのデータのライフタイムより広いライフタイムを持つ変数に与えることはできない。」
の制約から外れているためエラーとなる。</p>
<p>
ライフタイムについては後述するが、ここではスコープと同義であると考えて良い。</p>
<p>
このように、Rust は、データのライフタイムを厳密に管理することで、
コンパイル時にメモリ破壊の可能性を検知する機能を持っている。</p>
<p>
以降では、上記 Rust の変数についての制約について説明する。</p>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
あるデータに対する所有権を持つ変数がスコープから外れた時に、そのデータは開放される。
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
  データには所有権があり、その所有権を持つ変数がスコープから外れると、そのデータは開放される。</p>
<p>
  C のように malloc/free を明示的に呼び出す必要はない。</p>
<div class="src src-rust">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-rust" data-lang="rust"><span class="line"><span class="cl"><span class="p">{</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="kd">let</span><span class="w"> </span><span class="n">val</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="fm">vec!</span><span class="p">[</span><span class="mi">1</span><span class="p">,</span><span class="mi">2</span><span class="p">,</span><span class="mi">3</span><span class="p">];</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="fm">println!</span><span class="p">(</span><span class="w"> </span><span class="s">&#34;{}&#34;</span><span class="p">,</span><span class="w"> </span><span class="n">val</span><span class="p">[</span><span class="mi">0</span><span class="p">]</span><span class="w"> </span><span class="p">);</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w"></span><span class="p">}</span></span></span></code></pre></div>
</div>
<p>
  上記の例では、 val には Vec 型のデータの所有権が与えられ、
  println!() でデータを表示後、 val のスコープが外れるため、
  Vec 型のデータが開放される。</p>
<p>
  C++ では、似たように機能する unique_ptr がある。</p>
<p>
  「C++ の unique_ptr のようなもの」と説明したが、
  C++ で出来るなら Rust を使う意味はないじゃないか？という疑問を持つ方もいるだろう。
  だが、 C++ は unique_ptr が「使える」のであって、
  それを使うかどうかはプログラマ次第である。
  また、その使用方法に論理的な間違えがあったとしてもコンパイルは成功してしまい、
  実行時にエラーが発生することで初めて間違っていたことが分かる。</p>
<p>
  対して Rust は、プログラマ次第で「使える」のではなく、それしか「使えない」。
  また、使用方法に論理的な間違えがあればコンパイル時に分かる。</p>
<p>
  これは重要な違いである。</p>
<p>
  静的型付け言語を選択する理由の一つには、コンパイル時にさまざまな論理的なエラーを
  検知できることが大きい。
  これは、 Google が TypeScript を採用していることからも容易に想像できるだろう。</p>
<p>
  Rust は、コンパイル時検知可能なエラーに型エラーだけでなく、
  メモリ破壊も検知できることが特徴の言語である。</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
あるデータに対する所有権を持つ変数は、アクセス権も持つ。
</h3>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
アクセス権には、読み出し専用(immutable)と、読み書き用(mutable)がある。  
</h3>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
アクセス権のデフォルトは、読み出し専用 (immutable)。
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
  アクセス権とは、データの値を読み出す、書き込むことが出来る権利である。</p>
<p>
  C で const 宣言することで書き込みアクセスを禁止出来るように、
  Rust でもデータアクセスに対する制御が可能である。</p>
<p>
  多くの言語では、デフォルトのアクセス権は読み書き可能(mutable)であるのに対して、
  Rust のデフォルトは読み出し専用(immutable)である。</p>
<p>
  これは、上記で説明しているメモリ破壊検知を可能にする構文を前提に考えた場合、
  デフォルトを mutable にした方が、デフォルトを immutable にするよりも
  コーディング量が増える可能性があるためだと考えられる。</p>
</div>
</div>
