doc/rust/lifetime.org
** 変数は、別の変数にアクセス権だけを与えることができる。

  データの所有権は 1 つの変数しか持てない。
  これだと関数にデータを渡した時に所有権も渡ってしまうため、
  関数の処理が戻った後の処理でデータにアクセスできないことになる。

#+BEGIN_SRC rust
fn sub( dat: Vec<i32> ) {
  println!( "{}", dat[0] );
}
fn main() {
  let val = vec![1,2,3];
  sub( val );
  println!( "{}", val[0] ); // error
}
#+END_SRC

  これを回避するには、例えば次のように戻り値として所有権を返すことでも対応可能だが、
  これだと非常にコード量が多くなるし煩わしい。

#+BEGIN_SRC rust
fn sub( dat: Vec<i32> ) -> Vec<i32>  {
  println!( "{}", dat[0] );
  dat
}
fn main() {
  let val = vec![1,2,3];
  val = sub( val );
  println!( "{}", val[0] );
}
#+END_SRC

  そこで、Rust では所有権を渡さずにアクセス権だけを渡すことができる。

  具体的には次のようになる。
  
#+BEGIN_SRC rust
fn sub( dat: &Vec<i32> ) {
  println!( "{}", dat[0] );
}
fn main() {
  let val = vec![1,2,3];
  sub( &val );
  println!( "{}", val[0] );
}
#+END_SRC

  アクセス権には読み出し専用のアクセス権(Reference)と、
  読み書き用のアクセス権(Borrowing)がある。

  上記の例は読み出し専用 Reference の例である。

  読み出し専用 Reference を渡す場合、渡す側と受け取る側に & を付ける。
  これにより、通常の所有権の代入とアクセス権の代入とが区別される。
  

  読み書き用(Borrowing)の例は次のようになる。

#+BEGIN_SRC rust
fn sub( dat: &mut Vec<i32> ) {
  println!( "{}", dat[0] );
  dat[0] = 10;
}
fn main() {
  let mut val = vec![1,2,3];
  sub( &mut val );
  println!( "{}", val[0] ); // 10
}
#+END_SRC

  読み書き用 Borrowing を渡す場合、渡す側と受け取る側に &mut を付ける。

  アクセス権には次の特徴がある。
  
+ 読み出し専用のアクセス権(Reference)は、複数の変数に与えることができる。
+ 読み書き用のアクセス権(Borrowing)は、1 つの変数に与えることができる。
+ あるデータの Reference と Borrowing は、どちらか一方しか同時に存在出来ない。
  

公式ドキュメントでは、Reference を参照、 Borrowing を借用と訳している。
  
  
ここで次のコードを確認すると、

#+BEGIN_SRC rust -n
{
    let mut aaa = 1;
    {
        let val = &mut aaa;
        *val = 2;
    }
    println!("{}", aaa );
}
#+END_SRC

先ほどは「読み書き用 Borrowing を渡す場合、渡す側と受け取る側に &mut を付ける。」と
説明したが、上記 4行目で &aaa に対して let val になっている。

let &mut val = &mut aaa; になるのではないか？と、思ってしまうが、
これではコンパイルエラーになる。

ではどうするかというと、 &mut を付けるのは型の方になる。

#+BEGIN_SRC rust
let val: &mut i32 = &mut aaa;
#+END_SRC

ただ、 Rust では let で変数初期化する際は、型推論によって型を明示する必要がないため、
let val = &mut aaa; という形になる。

では次の 2 つのケースで何が違うのか

#+BEGIN_SRC rust
let val = &mut aaa;
#+END_SRC

#+BEGIN_SRC rust
let mut val = &mut aaa;
#+END_SRC

これは、次のサンプルを見ると分かり易い。

#+BEGIN_SRC rust
{
    let mut aaa = 1;
    let mut bbb = 10;
    {
        let mut val = &mut aaa;
        *val = 2;
        val = &mut bbb;
        *val = 3;
    }
    println!("{} {}", aaa, bbb); // 2 3
}
#+END_SRC

上記のサンプルはコンパイルは成功する。

一方で、次のサンプルは 7 行目 val = &mut bbb; の箇所でコンパイルエラーになる。

#+BEGIN_SRC rust -n
{
    let mut aaa = 1;
    let mut bbb = 10;
    {
        let val = &mut aaa;
        *val = 2;
        val = &mut bbb;
        *val = 3;
    }
    println!("{} {}", aaa, bbb);
}
#+END_SRC

つまり let mut の mut は、let で宣言した変数そのものに対する書き込み許可宣言であり、
変数が格納するデータの型には関係がない。

C の const int * pVal; と int * const pVal; の違いのようなものだ。

#+BEGIN_SRC rust
#include <stdio.h>

int main()
{
    int val = 0;
    const int * pVal1 = &val;
    int * const pVal2 = &val;
    *pVal1 = 1;   // エラー: pVal1 の参照先が書き込み禁止
    pVal1 = NULL; 
    *pVal2 = 1;
    pVal2 = NULL; // エラー: pVal2 そのものが書き込み禁止
    return 0;
}
#+END_SRC

