doc/rust/lifetime.org
** ある変数に格納されたデータへのアクセス権(Reference/Borrowing)を、そのデータのライフタイムより広いライフタイムを持つ変数に与えることはできない。


  これは、先に説明した通りである。
  
#+BEGIN_SRC rust
{
  let rval;
  {
     let mut val = 1;
     rval = &mut val; // error
  }
  *rval = 2;
}
#+END_SRC

  上記の例では、 rval に対して val の Borrowing を渡している。
  rval は val が保持するデータのライフタイムよりも大きいため、エラーとなる。


** Copy と 所有権の移動

先ほど、次の場合は所有権が移動するためコンパイルエラーになると説明した。
  
#+BEGIN_SRC rust
{
  let val = vec![1,2,3];
  let sub = val;
  println!( "{}", val[0] ); // error
}
#+END_SRC

一方で、次の場合はコンパイルエラーにならない。

#+BEGIN_SRC rust
{
  let val = [1,2,3];
  let sub = val;
  println!( "{}", val[0] );
}
#+END_SRC

この例の let sub = val; においては所有権の移動ではなく、
データの Copy が行なわれるためである。

Copy では、コピー元と同じデータが複製され、それが変数に代入される。

これにより、元の変数には Copy 後も所有権が残るため、
上記の場合はエラーが発生しない。

代入時に Copy されるか、所有権の移動が起るかは、そのデータ型の Copy トレイトが
実装されているかどうかでコンパイル時に切り替わる。

なお、Rust のプリミティブ型は全て Copy トレイトが実装されている。

* ライフタイム

Rust は、データのライフタイムを厳密に管理することで、
コンパイル時にメモリ破壊の可能性を検知する機能を持っている。

コンパイル時に検知するということは、
ソースコードの構文上にデータのライフタイムを示す情報が現われている、
ということでもある。

