doc/rust/lifetime.org
** 関数宣言におけるライフタイム

次のソースコードを見てみる。

#+BEGIN_SRC rust -n
fn sub(val1: &Vec<i32>, val2: &Vec<i32>) -> &Vec<i32> {
    val1
}
fn sub2(val1: &Vec<i32>, val2: &Vec<i32>) -> &Vec<i32> {
    val2
}
fn main() {
    let val0 = vec![0];
    let val1 = vec![1];
    {
        let mut val2 = &val0;
        let mut val3 = &val0;
        {
            let val4 = vec![2];
            val2 = sub(&val1, &val4);
            val3 = sub2(&val1, &val4);
        }
        println!("{} {}", val2[0], val3[0]);
    }
}
#+END_SRC

このソースコードはコンパイルエラーになる。

エラーになる原因は、sub, sub2 関数の戻り値の型が参照になっているが、
その参照元のライフタイムが不明なことにある。

では、なぜライフタイムが不明だとコンパイルエラーになるのか？

上記のソースの 16 行目の val3 = sub2(&val1, &val4); の箇所を見ると、
sub2() は第2引数を返していることから、この処理は val3 に &val4 を代入していることが分かる。
これは、Rust の「ある変数に格納されたデータへのアクセス権(Reference/Borrowing)を、
そのデータのライフタイムより広いライフタイムを持つ変数に与えることはできない」の
規則に違反していることになる。
しかし、sub2() が第二引数を返す、
つまりは sub2() の戻り値のライフタイムが第二引数と同じであることが分からないと、
変数の制約を満しているかどうかを判定することができない。
そして、判定することができないから、コンパイルエラーになる。

このコンパイルエラーを回避するには、
ライフタイムを明示する必要がある。

Rust では、次の 1, 4 行目のようにライフタイムを宣言する。

#+BEGIN_SRC rust -n
fn sub<'a, 'b>(val1: &'a Vec<i32>, val2: &'b Vec<i32>) -> &'a Vec<i32> {
    val1
}
fn sub2<'a, 'b>(val1: &'a Vec<i32>, val2: &'b Vec<i32>) -> &'b Vec<i32> {
    val2
}
fn main() {
    let val0 = vec![0];
    let val1 = vec![1];
    {
        let mut val2 = &val0;
        let mut val3 = &val0;
        {
            let val4 = vec![2];
            val2 = sub(&val1, &val4);
            //val3 = sub2(&val1, &val4); // error
        }
        println!("{} {}", val2[0], val3[0]);
    }
}
#+END_SRC

ライフタイムは ' で宣言し、ライフタイムを識別するための名前を指定する。

上記の例では 'a, 'b がライフタイムであり、
sub() の戻り値は第1引数と同じライフタイムで、
sub2() の戻り値は第2引数と同じライフタイムであることを示している。

この宣言されているライフタイムの情報によって、
Rust は上記 16 行目の処理が変数の制約を満していないことを判定することができる。

なお、宣言しているライフタイムと、
異なるライフタイムの戻り値を返すとコンパイルエラーになる。
例えば次の場合、関数は ライフタイム 'a の参照を返すと宣言しているが、
実際に返している val2 のライフタイムは 'b である。
これは、宣言と矛盾しているためコンパイルエラーとなる。

#+BEGIN_SRC rust
fn sub<'a, 'b>(val1: &'a Vec<i32>, val2: &'b Vec<i32>) -> &'a Vec<i32> {
    val2 // error
}
#+END_SRC

同じライフタイムの変数が複数ある場合、次のように宣言できる。

#+BEGIN_SRC rust
fn sub<'a>(val1: &'a Vec<i32>, val2: &'a Vec<i32>) -> &'a Vec<i32> {
    val2
}
#+END_SRC

ライフタイムを明示せずに省略すると、全てのライフタイムは同じになる。

例えば次の場合、

#+BEGIN_SRC rust
fn sub<'a>(val: &'a Vec<i32>) -> &'a Vec<i32> {
    val
}
#+END_SRC

次のように省略して記載できる。

#+BEGIN_SRC rust
fn sub(val: &Vec<i32>) -> &Vec<i32> {
    val
}
#+END_SRC


** 構造体宣言におけるライフタイム

構造体のメンバもライフタイムの明示が必要である。

#+BEGIN_SRC rust -n
struct Foo<'a, 'b> {
    xx: &'a Vec<i32>,
    yy: &'b Vec<i32>,
}
impl<'a, 'b> Foo<'a, 'b> {
    fn x(&self) -> &'a Vec<i32> { self.xx }

    fn y(&self) -> &'b Vec<i32> { self.yy }
}
fn main() {
    let x = vec![1];
    let mut z: &Vec<i32>;
    {
        let y = vec![2];
        let q;
        let mut f = Foo { xx: &x, yy: &y };
        z = f.x();
        q = f.y();
        println!("{} {} {}", z[0], q[0], f.y()[0] ); // 1 2 2
        //z = f.y(); // error
        f.yy = &x;
        println!("{} {} {}", z[0], q[0], f.y()[0] ); // 1 2 1
        //z = f.y(); // error
    }
}
#+END_SRC

上記は構造体 Foo と、そのメソッド x(), y() を定義している。
構造体 Foo は参照型の変数 xx と yy の保持しており、
メソッド Foo.x(), Foo.y() は Foo.xx, Foo.yy を返す。

16 行目で構造体が生成されるが、
このとき Foo.xx は x、 Foo.yy は y の参照で初期化される。
これによって、Foo.xx と Foo.yy のライフタイムも決定される。

次に 17, 18 行目で Foo.x(), Foo.y() をコールし、その結果を z, q に代入している。

この代入は変数の制約を満しているため、成功する。

一方で、20 行目の代入はコンパイルエラーとなる。
これは、16 行目の段階で Foo.y() のライフタイムが y と同じであることが決定していて、
z のライフタイムは y のライフタイムよりも大きいため、変数の制約を満さないのでエラーとなる。

一方で、21 行目の代入は成功する。
Foo.yy のライフタイムは y と同じであるが、 x のライフタイムは y よりも大きい。
よって、制限を満すため代入は成功する。
ただし、この代入はデータ自体の代入を行なうが、
Foo.yy のライフタイム自体は y と同じままである。

次に 23 行目の代入はコンパイルエラーとなる。
これは先程説明した通り、 Foo.yy に x の参照を代入しても、
Foo.yy のライフタイムは y のまま変わらないため、変数の制約を満さない。

*** 構造体データの所有権、アクセス権移動

構造体データの所有権、アクセス権移動には、
宣言したライフタイムの中で一番短いライフタイムが制約を満す必要がある。

#+BEGIN_SRC rust -n
struct Foo<'a,'b> {
    xx: &'a Vec<i32>,
    yy: &'b Vec<i32>,
}

fn main() {
    let zzz = vec![2];
    let aaa;
    {
        let bbb = vec![1];
        let ccc = Foo { xx: &bbb, yy: &zzz };
        // aaa = ccc; // error
    }
}
#+END_SRC

上記の場合、 12行目の所有権移動は bbb と zzz のライフタイムの短かい方が、
制約を満す必要がある。

bbb と zzz では、bbb の方がライフタイムが短い。
また aaa は bbb よりもライフタイムが長いため、
12 行目は制約を満さずにコンパイルエラーになる。


次の場合は、aaa よりも bbb のライフタイムが長くなるため、
12 行目の代入は可能になる。

#+BEGIN_SRC rust -n
struct Foo<'a,'b> {
    xx: &'a Vec<i32>,
    yy: &'b Vec<i32>,
}

fn main() {
    let zzz = vec![2];
    let bbb = vec![1];
    let aaa;
    {
        let ccc = Foo { xx: &bbb, yy: &zzz };
        aaa = ccc;
    }
}
#+END_SRC


