hugo/public/rust/lifetime/index.html
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
関数宣言におけるライフタイム
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<p>
次のソースコードを見てみる。</p>
<div class="src src-rust -n">
<pre tabindex="0"><code class="language-rust -n" data-lang="rust -n">fn sub(val1: &amp;Vec&lt;i32&gt;, val2: &amp;Vec&lt;i32&gt;) -&gt; &amp;Vec&lt;i32&gt; {
    val1
}
fn sub2(val1: &amp;Vec&lt;i32&gt;, val2: &amp;Vec&lt;i32&gt;) -&gt; &amp;Vec&lt;i32&gt; {
    val2
}
fn main() {
    let val0 = vec![0];
    let val1 = vec![1];
    {
        let mut val2 = &amp;val0;
        let mut val3 = &amp;val0;
        {
            let val4 = vec![2];
            val2 = sub(&amp;val1, &amp;val4);
            val3 = sub2(&amp;val1, &amp;val4);
        }
        println!(&#34;{} {}&#34;, val2[0], val3[0]);
    }
}</code></pre>
</div>
<p>
このソースコードはコンパイルエラーになる。</p>
<p>
エラーになる原因は、sub, sub2 関数の戻り値の型が参照になっているが、
その参照元のライフタイムが不明なことにある。</p>
<p>
では、なぜライフタイムが不明だとコンパイルエラーになるのか？</p>
<p>
上記のソースの 16 行目の val3 = sub2(&amp;val1, &amp;val4); の箇所を見ると、
sub2() は第2引数を返していることから、この処理は val3 に &amp;val4 を代入していることが分かる。
これは、Rust の「ある変数に格納されたデータへのアクセス権(Reference/Borrowing)を、
そのデータのライフタイムより広いライフタイムを持つ変数に与えることはできない」の
規則に違反していることになる。
しかし、sub2() が第二引数を返す、
つまりは sub2() の戻り値のライフタイムが第二引数と同じであることが分からないと、
変数の制約を満しているかどうかを判定することができない。
そして、判定することができないから、コンパイルエラーになる。</p>
<p>
このコンパイルエラーを回避するには、
ライフタイムを明示する必要がある。</p>
<p>
Rust では、次の 1, 4 行目のようにライフタイムを宣言する。</p>
<div class="src src-rust -n">
<pre tabindex="0"><code class="language-rust -n" data-lang="rust -n">fn sub&lt;&#39;a, &#39;b&gt;(val1: &amp;&#39;a Vec&lt;i32&gt;, val2: &amp;&#39;b Vec&lt;i32&gt;) -&gt; &amp;&#39;a Vec&lt;i32&gt; {
    val1
}
fn sub2&lt;&#39;a, &#39;b&gt;(val1: &amp;&#39;a Vec&lt;i32&gt;, val2: &amp;&#39;b Vec&lt;i32&gt;) -&gt; &amp;&#39;b Vec&lt;i32&gt; {
    val2
}
fn main() {
    let val0 = vec![0];
    let val1 = vec![1];
    {
        let mut val2 = &amp;val0;
        let mut val3 = &amp;val0;
        {
            let val4 = vec![2];
            val2 = sub(&amp;val1, &amp;val4);
            //val3 = sub2(&amp;val1, &amp;val4); // error
        }
        println!(&#34;{} {}&#34;, val2[0], val3[0]);
    }
}</code></pre>
</div>
<p>
ライフタイムは &#39; で宣言し、ライフタイムを識別するための名前を指定する。</p>
<p>
上記の例では &#39;a, &#39;b がライフタイムであり、
sub() の戻り値は第1引数と同じライフタイムで、
sub2() の戻り値は第2引数と同じライフタイムであることを示している。</p>
<p>
この宣言されているライフタイムの情報によって、
Rust は上記 16 行目の処理が変数の制約を満していないことを判定することができる。</p>
<p>
なお、宣言しているライフタイムと、
異なるライフタイムの戻り値を返すとコンパイルエラーになる。
例えば次の場合、関数は ライフタイム &#39;a の参照を返すと宣言しているが、
実際に返している val2 のライフタイムは &#39;b である。
これは、宣言と矛盾しているためコンパイルエラーとなる。</p>
<div class="src src-rust">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-rust" data-lang="rust"><span class="line"><span class="cl"><span class="k">fn</span> <span class="nf">sub</span><span class="o">&lt;&#39;</span><span class="na">a</span><span class="p">,</span><span class="w"> </span><span class="o">&#39;</span><span class="na">b</span><span class="o">&gt;</span><span class="p">(</span><span class="n">val1</span>: <span class="kp">&amp;</span><span class="o">&#39;</span><span class="na">a</span> <span class="nb">Vec</span><span class="o">&lt;</span><span class="kt">i32</span><span class="o">&gt;</span><span class="p">,</span><span class="w"> </span><span class="n">val2</span>: <span class="kp">&amp;</span><span class="o">&#39;</span><span class="na">b</span> <span class="nb">Vec</span><span class="o">&lt;</span><span class="kt">i32</span><span class="o">&gt;</span><span class="p">)</span><span class="w"> </span>-&gt; <span class="kp">&amp;</span><span class="o">&#39;</span><span class="na">a</span> <span class="nb">Vec</span><span class="o">&lt;</span><span class="kt">i32</span><span class="o">&gt;</span><span class="w"> </span><span class="p">{</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="n">val2</span><span class="w"> </span><span class="c1">// error
</span></span></span><span class="line"><span class="cl"><span class="c1"></span><span class="p">}</span></span></span></code></pre></div>
</div>
<p>
同じライフタイムの変数が複数ある場合、次のように宣言できる。</p>
<div class="src src-rust">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-rust" data-lang="rust"><span class="line"><span class="cl"><span class="k">fn</span> <span class="nf">sub</span><span class="o">&lt;&#39;</span><span class="na">a</span><span class="o">&gt;</span><span class="p">(</span><span class="n">val1</span>: <span class="kp">&amp;</span><span class="o">&#39;</span><span class="na">a</span> <span class="nb">Vec</span><span class="o">&lt;</span><span class="kt">i32</span><span class="o">&gt;</span><span class="p">,</span><span class="w"> </span><span class="n">val2</span>: <span class="kp">&amp;</span><span class="o">&#39;</span><span class="na">a</span> <span class="nb">Vec</span><span class="o">&lt;</span><span class="kt">i32</span><span class="o">&gt;</span><span class="p">)</span><span class="w"> </span>-&gt; <span class="kp">&amp;</span><span class="o">&#39;</span><span class="na">a</span> <span class="nb">Vec</span><span class="o">&lt;</span><span class="kt">i32</span><span class="o">&gt;</span><span class="w"> </span><span class="p">{</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="n">val2</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w"></span><span class="p">}</span></span></span></code></pre></div>
</div>
<p>
ライフタイムを明示せずに省略すると、全てのライフタイムは同じになる。</p>
<p>
例えば次の場合、</p>
<div class="src src-rust">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-rust" data-lang="rust"><span class="line"><span class="cl"><span class="k">fn</span> <span class="nf">sub</span><span class="o">&lt;&#39;</span><span class="na">a</span><span class="o">&gt;</span><span class="p">(</span><span class="n">val</span>: <span class="kp">&amp;</span><span class="o">&#39;</span><span class="na">a</span> <span class="nb">Vec</span><span class="o">&lt;</span><span class="kt">i32</span><span class="o">&gt;</span><span class="p">)</span><span class="w"> </span>-&gt; <span class="kp">&amp;</span><span class="o">&#39;</span><span class="na">a</span> <span class="nb">Vec</span><span class="o">&lt;</span><span class="kt">i32</span><span class="o">&gt;</span><span class="w"> </span><span class="p">{</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="n">val</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w"></span><span class="p">}</span></span></span></code></pre></div>
</div>
<p>
次のように省略して記載できる。</p>
<div class="src src-rust">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-rust" data-lang="rust"><span class="line"><span class="cl"><span class="k">fn</span> <span class="nf">sub</span><span class="p">(</span><span class="n">val</span>: <span class="kp">&amp;</span><span class="nb">Vec</span><span class="o">&lt;</span><span class="kt">i32</span><span class="o">&gt;</span><span class="p">)</span><span class="w"> </span>-&gt; <span class="kp">&amp;</span><span class="nb">Vec</span><span class="o">&lt;</span><span class="kt">i32</span><span class="o">&gt;</span><span class="w"> </span><span class="p">{</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="n">val</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w"></span><span class="p">}</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
構造体宣言におけるライフタイム
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<p>
構造体のメンバもライフタイムの明示が必要である。</p>
<div class="src src-rust -n">
<pre tabindex="0"><code class="language-rust -n" data-lang="rust -n">struct Foo&lt;&#39;a, &#39;b&gt; {
    xx: &amp;&#39;a Vec&lt;i32&gt;,
    yy: &amp;&#39;b Vec&lt;i32&gt;,
}
impl&lt;&#39;a, &#39;b&gt; Foo&lt;&#39;a, &#39;b&gt; {
    fn x(&amp;self) -&gt; &amp;&#39;a Vec&lt;i32&gt; { self.xx }

    fn y(&amp;self) -&gt; &amp;&#39;b Vec&lt;i32&gt; { self.yy }
}
fn main() {
    let x = vec![1];
    let mut z: &amp;Vec&lt;i32&gt;;
    {
        let y = vec![2];
        let q;
        let mut f = Foo { xx: &amp;x, yy: &amp;y };
        z = f.x();
        q = f.y();
        println!(&#34;{} {} {}&#34;, z[0], q[0], f.y()[0] ); // 1 2 2
        //z = f.y(); // error
        f.yy = &amp;x;
        println!(&#34;{} {} {}&#34;, z[0], q[0], f.y()[0] ); // 1 2 1
        //z = f.y(); // error
    }
}</code></pre>
</div>
<p>
上記は構造体 Foo と、そのメソッド x(), y() を定義している。
構造体 Foo は参照型の変数 xx と yy の保持しており、
メソッド Foo.x(), Foo.y() は Foo.xx, Foo.yy を返す。</p>
<p>
16 行目で構造体が生成されるが、
このとき Foo.xx は x、 Foo.yy は y の参照で初期化される。
これによって、Foo.xx と Foo.yy のライフタイムも決定される。</p>
<p>
次に 17, 18 行目で Foo.x(), Foo.y() をコールし、その結果を z, q に代入している。</p>
<p>
この代入は変数の制約を満しているため、成功する。</p>
<p>
一方で、20 行目の代入はコンパイルエラーとなる。
これは、16 行目の段階で Foo.y() のライフタイムが y と同じであることが決定していて、
z のライフタイムは y のライフタイムよりも大きいため、変数の制約を満さないのでエラーとなる。</p>
<p>
一方で、21 行目の代入は成功する。
Foo.yy のライフタイムは y と同じであるが、 x のライフタイムは y よりも大きい。
よって、制限を満すため代入は成功する。
ただし、この代入はデータ自体の代入を行なうが、
Foo.yy のライフタイム自体は y と同じままである。</p>
<p>
次に 23 行目の代入はコンパイルエラーとなる。
これは先程説明した通り、 Foo.yy に x の参照を代入しても、
Foo.yy のライフタイムは y のまま変わらないため、変数の制約を満さない。</p>
<div id="outline-container-headline-15" class="outline-4">
<h4 id="headline-15">
構造体データの所有権、アクセス権移動
</h4>
<div id="outline-text-headline-15" class="outline-text-4">
<p>
構造体データの所有権、アクセス権移動には、
宣言したライフタイムの中で一番短いライフタイムが制約を満す必要がある。</p>
<div class="src src-rust -n">
<pre tabindex="0"><code class="language-rust -n" data-lang="rust -n">struct Foo&lt;&#39;a,&#39;b&gt; {
    xx: &amp;&#39;a Vec&lt;i32&gt;,
    yy: &amp;&#39;b Vec&lt;i32&gt;,
}

fn main() {
    let zzz = vec![2];
    let aaa;
    {
        let bbb = vec![1];
        let ccc = Foo { xx: &amp;bbb, yy: &amp;zzz };
        // aaa = ccc; // error
    }
}</code></pre>
</div>
<p>
上記の場合、 12行目の所有権移動は bbb と zzz のライフタイムの短かい方が、
制約を満す必要がある。</p>
<p>
bbb と zzz では、bbb の方がライフタイムが短い。
また aaa は bbb よりもライフタイムが長いため、
12 行目は制約を満さずにコンパイルエラーになる。</p>
<p>
次の場合は、aaa よりも bbb のライフタイムが長くなるため、
12 行目の代入は可能になる。</p>
<div class="src src-rust -n">
<pre tabindex="0"><code class="language-rust -n" data-lang="rust -n">struct Foo&lt;&#39;a,&#39;b&gt; {
    xx: &amp;&#39;a Vec&lt;i32&gt;,
    yy: &amp;&#39;b Vec&lt;i32&gt;,
}

fn main() {
    let zzz = vec![2];
    let bbb = vec![1];
    let aaa;
    {
        let ccc = Foo { xx: &amp;bbb, yy: &amp;zzz };
        aaa = ccc;
    }
}</code></pre>
</div>
</div>
</div>
</div>
</div>
